k6 test.txt
Reservation-Service$ k6 run --vus 1000 --duration 120s script.js

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: script.js
     output: -

  scenarios: (100.00%) 1 scenario, 1000 max VUs, 2m30s max duration (incl. graceful stop):
           * default: 1000 looping VUs for 2m0s (gracefulStop: 30s)


running (2m01.4s), 0000/1000 VUs, 73239 complete and 0 interrupted iterations
default ✓ [======================================] 1000 VUs  2m0s

    data_received..............: 51 MB  417 kB/s
    data_sent..................: 7.0 MB 57 kB/s
    http_req_blocked...........: avg=2.13ms   min=2.24µs   med=5.08µs   max=412.24ms p(90)=8.29µs   p(95)=13.46µs 
    http_req_connecting........: avg=2.1ms    min=0s       med=0s       max=383.83ms p(90)=0s       p(95)=0s      
    http_req_duration..........: avg=643.11ms min=102.5ms  med=481.5ms  max=4.29s    p(90)=1.15s    p(95)=1.27s   
    http_req_receiving.........: avg=73.63µs  min=27.15µs  med=67.07µs  max=3.9ms    p(90)=101.49µs p(95)=118.77µs
    http_req_sending...........: avg=422.15µs min=8.49µs   med=21.83µs  max=182.99ms p(90)=35.82µs  p(95)=47.15µs 
    http_req_tls_handshaking...: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
    http_req_waiting...........: avg=642.61ms min=102.42ms med=481.41ms max=4.28s    p(90)=1.15s    p(95)=1.27s   
    http_reqs..................: 73239  603.247203/s
    iteration_duration.........: avg=1.64s    min=1.1s     med=1.48s    max=5.46s    p(90)=2.15s    p(95)=2.27s   
    iterations.................: 73239  603.247203/s
    vus........................: 372    min=372  max=1000
    vus_max....................: 1000   min=1000 max=1000